{"config": [{"config": {"batch_input_shape": [null, 64, 64, 3], "nb_filter": 32, "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "linear", "bias": true, "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null, "name": "convolution2d_9"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_9", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "nb_filter": 64, "W_constraint": null, "activation": "linear", "bias": true, "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_col": 3, "trainable": true, "W_regularizer": null, "name": "convolution2d_10"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_10", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_13", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "nb_filter": 64, "W_constraint": null, "activation": "linear", "bias": true, "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_col": 3, "trainable": true, "W_regularizer": null, "name": "convolution2d_11"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_11", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_14", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"batch_input_shape": [null, 2304], "output_dim": 64, "W_constraint": null, "activation": "linear", "bias": true, "input_dtype": "float32", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 2304, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "name": "dense_10"}, "class_name": "Dense"}, {"config": {"name": "elu_15", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"batch_input_shape": [null, 64], "output_dim": 16, "W_constraint": null, "activation": "linear", "bias": true, "input_dtype": "float32", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 64, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "name": "dense_11"}, "class_name": "Dense"}, {"config": {"name": "leakyrelu_4", "trainable": true, "alpha": 0.3}, "class_name": "LeakyReLU"}, {"config": {"batch_input_shape": [null, 16], "output_dim": 1, "W_constraint": null, "activation": "linear", "bias": true, "input_dtype": "float32", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 16, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "name": "dense_12"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}