{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_9", "nb_col": 3, "bias": true, "nb_filter": 32, "batch_input_shape": [null, 64, 64, 3], "W_constraint": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "input_dtype": "float32", "nb_row": 3, "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_9", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_10", "nb_col": 3, "bias": true, "nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_10", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_13", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_11", "nb_col": 3, "bias": true, "nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_11", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_14", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_10", "bias": true, "batch_input_shape": [null, 2304], "W_constraint": null, "output_dim": 64, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "input_dim": 2304, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_15", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_11", "bias": true, "batch_input_shape": [null, 64], "W_constraint": null, "output_dim": 16, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "input_dim": 64, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_4", "alpha": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_12", "bias": true, "batch_input_shape": [null, 16], "W_constraint": null, "output_dim": 1, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "input_dim": 16, "activation": "linear"}}], "keras_version": "1.2.1"}